/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   this_special.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: umoff <umoff@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/06/03 13:38:52 by umoff             #+#    #+#             */
/*   Updated: 2020/07/02 14:03:29 by umoff            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
** Функция проверки на делиметры (разделители)
*/

_Bool	this_special(char c, char *special)
{
	while (*special)
	{
		if (c == *special)
			return (1);
		special++;
	}
	return (0);
}
